dual_ducted_fan/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox          |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  11                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
convertToMeters 1;

vertices
(
    (-0.75 -0.90 -0.75)
    ( 0.75 -0.90 -0.75)
    ( 0.75  0.30 -0.75)
    (-0.75  0.30 -0.75)
    (-0.75 -0.90  0.75)
    ( 0.75 -0.90  0.75)
    ( 0.75  0.30  0.75)
    (-0.75  0.30  0.75)
    // (-0.90 -1.20 -0.90)   // x-, y-, z-
    // ( 0.90 -1.20 -0.90)
    // ( 0.90  0.45 -0.90)
    // (-0.90  0.45 -0.90)
    // (-0.90 -1.20  0.90)
    // ( 0.90 -1.20  0.90)
    // ( 0.90  0.45  0.90)
    // (-0.90  0.45  0.90)
);

blocks
(
    // 分割は目安（元の 12x20x12 をスケールアップ）
    hex (0 1 2 3 4 5 6 7) (24 24 24) simpleGrading (1 1 1)
    // hex (0 1 2 3 4 5 6 7) (40 48 40) simpleGrading (1 1.3 1)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (2 6 5 1)
            (0 3 2 1)
            (0 4 7 3)
            (4 5 6 7)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
);
